# üöÄ Gu√≠a Completa de Seguridad en Switches Cisco

## üìö **1. VLANs (Virtual Local Area Networks)**

### **Concepto Te√≥rico Detallado**

**¬øQu√© es una VLAN?**
Una VLAN es una **red l√≥gica independiente** dentro de una red f√≠sica. Imagina un edificio de oficinas donde cada departamento tiene su propio espacio privado aunque compartan el mismo edificio f√≠sico.

**Problema que resuelve:**

- **Dominios de broadcast grandes**: Sin VLANs, toda la red recibe tr√°fico broadcast
- **Seguridad**: Dispositivos en diferentes departamentos pueden comunicarse libremente
- **Rendimiento**: Tr√°fico innecesario en todos los puertos

**Tipos de VLANs:**

  - **VLAN de datos**: Para usuarios finales
  - **VLAN de voz**: Para tr√°fico VoIP (prioridad alta)
  - **VLAN de administraci√≥n**: Para gesti√≥n del switch
  - **VLAN nativa**: Para tr√°fico sin etiquetar en trunks

![](img/VLAN_Concept.svg)

![](img/extending-vlans-without-trunk-link.gif)


### ¬øQu√© es un trunk?

*Un trunk es un enlace de red que transporta m√∫ltiples VLANs simult√°neamente entre switches o entre un switch y un router.**

### **Analog√≠a para Entenderlo**

```bash
# SIN TRUNK (Access Ports):
Cada VLAN = Carretera separada
Puerto access = Rampa de entrada/salida a UNA carretera

# CON TRUNK:
Trunk = Autopista con M√öLTIPLES carriles (cada carril = una VLAN)
Cada frame lleva "etiqueta" que dice a qu√© carril (VLAN) pertenece
```

### **Problema que Resuelve**

```bash
# ESCENARIO SIN TRUNK:
Switch A (VLAN 10,20,30) --- Switch B (VLAN 10,20,30)
Necesitar√≠as: 3 cables separados (uno por VLAN)
‚ùå Ineficiente ‚ùå Costoso ‚ùå No escalable

# ESCENARIO CON TRUNK:
Switch A (VLAN 10,20,30) ---[UN CABLE]--- Switch B (VLAN 10,20,30)
‚úÖ Un solo cable transporta TODAS las VLANs
‚úÖ Eficiente ‚úÖ Escalable ‚úÖ Flexible
```

## üèóÔ∏è **C√≥mo Funciona el Trunking T√©cnicamente**

### **Protocolo 802.1Q (Dot1Q)**

![](img/trunking.webp)

### **Ejemplo de Etiquetado**

![](img/tagging1.jpg)

![](img/tagging_gif.gif)

## ‚öôÔ∏è **Configuraci√≥n de Trunks en Cisco**

### **Comandos B√°sicos**

```bash
! CONFIGURAR PUERTO COMO TRUNK
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# switchport mode trunk
! El puerto ahora transporta TODAS las VLANs

! LIMITAR VLANs PERMITIDAS EN EL TRUNK
Switch(config-if)# switchport trunk allowed vlan 10,20,30
! Solo estas VLANs pueden pasar por el trunk

! VERIFICACI√ìN
Switch# show interfaces trunk
Port        Mode         Encapsulation  Status        Native vlan
Gi0/1       on           802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/1       10,20,30
```

### **Modos de Operaci√≥n de Puertos**

```bash
# SWITCHPORT MODE TRUNK ‚Üí Forza trunk, negocia DTP
# SWITCHPORT MODE DYNAMIC DESIRABLE ‚Üí Intenta formar trunk
# SWITCHPORT MODE DYNAMIC AUTO ‚Üí Espera que otro inicie trunk  
# SWITCHPORT MODE ACCESS ‚Üí Solo una VLAN (no trunk)
```



## üè∑Ô∏è **¬øQu√© es la VLAN NATIVA?**

### **Concepto Fundamental**

**La VLAN nativa es la √∫nica VLAN cuyos frames viajan SIN etiqueta 802.1Q a trav√©s de un trunk.**

### **Prop√≥sito de la VLAN Nativa**

```bash
# COMUNICACI√ìN CON DISPOSITIVOS QUE NO ENTIENDEN 802.1Q
- Dispositivos legacy
- Algunos servidores
- Equipos de red antiguos
- Dispositivos que no soportan VLAN tagging
```

### **Comportamiento**

```bash
# PARA TR√ÅFICO DE VLAN NATIVA:
Frame entra al trunk ‚Üí NO se a√±ade etiqueta 802.1Q
Frame sale del trunk ‚Üí Se asume que pertenece a VLAN nativa

# PARA TR√ÅFICO DE OTRAS VLANs:
Frame entra al trunk ‚Üí SE A√ëADE etiqueta 802.1Q con VLAN ID
Frame sale del trunk ‚Üí SE REMUEVE etiqueta, se env√≠a a VLAN correcta
```

## ‚ö†Ô∏è **IMPORTANTE: Consideraciones de Seguridad**

### **Problema de Seguridad con VLAN Nativa**

```bash
# ATAQUE DE SALTO DE VLAN (VLAN HOPPING)
Atacante puede:
1. Enviar frames etiquetados con VLAN nativa
2. Switch puede remover etiqueta y enviar a VLAN nativa
3. Posible acceso no autorizado a VLAN nativa

# SOLUCI√ìN RECOMENDADA:
NUNCA usar VLAN 1 como nativa
Usar VLAN "basura" no utilizada para nativa
```

### **Configuraci√≥n Segura**

```bash
! CONFIGURACI√ìN NO SEGURA (POR DEFECTO)
Switch(config-if)# switchport trunk native vlan 1
! ‚ùå VLAN 1 es default y puede tener dispositivos

! CONFIGURACI√ìN SEGURA (RECOMENDADA)
Switch(config-if)# switchport trunk native vlan 999
Switch(config)# vlan 999  
Switch(config-vlan)# name VLAN_BASURA_NATIVA
Switch(config-vlan)# exit
! ‚úÖ VLAN 999 no tiene dispositivos, solo existe para tr√°fico nativo
```

## üîß **Configuraci√≥n Completa y Segura**

### **Ejemplo Pr√°ctico Corporativo**

```bash
! ESCENARIO: Empresa con 3 departamentos + VLAN de administraci√≥n

! CREAR VLANs
Switch(config)# vlan 10
Switch(config-vlan)# name VENTAS
Switch(config-vlan)# vlan 20
Switch(config-vlan)# name IT
Switch(config-vlan)# vlan 30
Switch(config-vlan)# name CONTABILIDAD
Switch(config-vlan)# vlan 99
Switch(config-vlan)# name ADMIN
Switch(config-vlan)# vlan 999
Switch(config-vlan)# name NATIVA_SEGURA
Switch(config-vlan)# exit

! CONFIGURAR TRUNK SEGURO
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# description TRUNK_TO_CORE_SWITCH
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk native vlan 999
Switch(config-if)# switchport trunk allowed vlan 10,20,30,99
! ‚úÖ Solo las VLANs necesarias
! ‚úÖ VLAN nativa segura (999)
! ‚úÖ Explic√≠tamente no permite VLAN 1

! CONFIGURAR EL OTRO EXTREMO (SWITCH CORE)
CoreSwitch(config)# interface gigabitethernet 0/1  
CoreSwitch(config-if)# description TRUNK_TO_ACCESS_SWITCH
CoreSwitch(config-if)# switchport mode trunk
CoreSwitch(config-if)# switchport trunk native vlan 999
CoreSwitch(config-if)# switchport trunk allowed vlan 10,20,30,99
```

### **Configuraci√≥n de Puertos de Acceso**

```bash
! PUERTOS PARA USUARIOS (NO TRUNK)
Switch(config)# interface range fastethernet 0/1-8
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# description USUARIOS_VENTAS

Switch(config)# interface range fastethernet 0/9-16  
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# description USUARIOS_IT
```

## üìä **Verificaci√≥n y Troubleshooting**

### **Comandos de Verificaci√≥n**

```bash
! VER ESTADO DE TRUNKS
Switch# show interfaces trunk
Port        Mode         Encapsulation  Status        Native vlan
Gi0/1       on           802.1q         trunking      999
Gi0/2       auto         802.1q         trunking      1

Port        Vlans allowed on trunk
Gi0/1       10,20,30,99
Gi0/2       1-4094

! VER CONFIGURACI√ìN DE INTERFAZ ESPEC√çFICA
Switch# show interfaces gigabitethernet 0/1 switchport
Name: Gi0/1
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 999 (VLAN_BASURA_NATIVA)
Trunking VLANs Enabled: 10,20,30,99

! VER ESTAD√çSTICAS DE TRUNK
Switch# show interfaces gigabitethernet 0/1 trunk
Port        Vlans allowed on trunk
Gi0/1       10,20,30,99

Port        Vlans allowed and active in management domain
Gi0/1       10,20,30,99

Port        Vlans in spanning tree forwarding state and not pruned
Gi0/1       10,20,30,99
```

### **Troubleshooting Com√∫n**

```bash
# PROBLEMA 1: Trunk no se forma
CAUSA: Mismatch en configuraci√≥n de trunk
SOLUCI√ìN: Verificar que ambos lados est√©n en "switchport mode trunk"

# PROBLEMA 2: VLAN nativa mismatch  
CAUSA: Diferente VLAN nativa en cada extremo
S√çNTOMA: P√©rdida de conectividad para VLAN nativa
SOLUCI√ìN: Configurar misma VLAN nativa en ambos extremos

# PROBLEMA 3: VLAN no permitida en trunk
CAUSA: VLAN no est√° en "allowed vlan list"
S√çNTOMA: Dispositivos en esa VLAN no pueden comunicarse through trunk
SOLUCI√ìN: A√±adir VLAN a la lista permitida
```

## üéØ **Resumen de Conceptos Clave**

### **TRUNK:**
```bash
‚úÖ Transporta M√öLTIPLES VLANs en un solo enlace f√≠sico
‚úÖ Usa etiquetado 802.1Q para identificar a qu√© VLAN pertenece cada frame
‚úÖ Esencial para conectar switches en redes con m√∫ltiples VLANs
‚úÖ Debe configurarse igual en ambos extremos del enlace
```

### **VLAN NATIVA:**
```bash
‚úÖ √önica VLAN que viaja SIN etiqueta 802.1Q en un trunk
‚úÖ Por defecto es VLAN 1 (‚ùå INSECURO)
‚úÖ Mejor pr√°ctica: Usar VLAN no utilizada (ej: 999)
‚úÖ Debe coincidir en ambos extremos del trunk
```

### **MEJORES PR√ÅCTICAS:**
```bash
1. ‚úÖ NUNCA usar VLAN 1 para nada
2. ‚úÖ Usar VLAN dedicada no utilizada como nativa (999, 4094, etc.)
3. ‚úÖ Limitar VLANs permitidas en trunk solo a las necesarias
4. ‚úÖ Deshabilitar puertos no utilizados
5. ‚úÖ Configurar manualmente trunks en lugar de usar auto-negotiation
6. ‚úÖ Documentar configuraci√≥n de trunks
```


### **Comandos Explicados Paso a Paso**

```bash
! CREACI√ìN DE VLANs
Switch# configure terminal
Switch(config)# vlan 10
! El comando 'vlan 10' crea o entra en la configuraci√≥n de la VLAN 10
! Las VLANs 1-1005 son est√°ndar, 1006-4094 son extendidas

Switch(config-vlan)# name VENTAS
! 'name' asigna un nombre descriptivo para identificar la VLAN f√°cilmente

Switch(config-vlan)# exit
! Sale del modo de configuraci√≥n de VLAN

! ASIGNACI√ìN DE PUERTOS A VLANs
Switch(config)# interface fastethernet 0/1
! Selecciona el puerto f√≠sico para configurar

Switch(config-if)# switchport mode access
! 'switchport mode access' configura el puerto como acceso (solo una VLAN)
! Esto significa que el dispositivo conectado no espera etiquetas VLAN

Switch(config-if)# switchport access vlan 10
! Asigna el puerto espec√≠ficamente a la VLAN 10
! El dispositivo conectado estar√° en la red l√≥gica de VENTAS

! CONFIGURACI√ìN DE PUERTOS TRUNK
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# switchport mode trunk
! 'switchport mode trunk' configura el puerto para transportar m√∫ltiples VLANs
! Los trunks usan etiquetas 802.1Q para identificar a qu√© VLAN pertenece cada frame

Switch(config-if)# switchport trunk native vlan 999
! 'native vlan' define qu√© VLAN viaja sin etiquetar
! Por seguridad, NUNCA usar VLAN 1 como nativa

Switch(config-if)# switchport trunk allowed vlan 10,20,30
! 'allowed vlan' especifica qu√© VLANs pueden pasar por el trunk
! Esto proporciona control granular sobre qu√© VLANs se propagan

! VERIFICACI√ìN
Switch# show vlan brief
! Muestra todas las VLANs y qu√© puertos est√°n asignados a cada una
Switch# show interfaces trunk
! Muestra informaci√≥n detallada sobre puertos trunk
```

### **Ejemplo Pr√°ctico Completo**

```bash
! ESCENARIO: Empresa con 3 departamentos
Switch(config)# vlan 10
Switch(config-vlan)# name VENTAS
Switch(config-vlan)# exit

Switch(config)# vlan 20
Switch(config-vlan)# name IT
Switch(config-vlan)# exit

Switch(config)# vlan 30
Switch(config-vlan)# name CONTABILIDAD
Switch(config-vlan)# exit

Switch(config)# vlan 99
Switch(config-vlan)# name ADMINISTRACION
Switch(config-vlan)# exit

! Asignar puertos a departamentos
Switch(config)# interface range fastethernet 0/1-8
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# description PUERTOS_VENTAS

Switch(config)# interface range fastethernet 0/9-16
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# description PUERTOS_IT

! Configurar IP de gesti√≥n en VLAN de administraci√≥n
Switch(config)# interface vlan 99
Switch(config-if)# ip address 192.168.99.10 255.255.255.0
Switch(config-if)# no shutdown
! Esto permite administrar el switch remotamente mediante SSH/Telnet
```

---

## üîí **2. Port Security**

### **Concepto Te√≥rico Detallado**

**¬øQu√© es Port Security?**
Es un mecanismo que **restringe qu√© dispositivos pueden conectarse** a un puerto del switch bas√°ndose en direcciones MAC.

![](img/port_security.webp)

**Problemas que resuelve:**

   - **Conectividad no autorizada**: Evita que usuarios conecten dispositivos no autorizados
   - **Ataques MAC flooding**: Previene que atacantes saturen la tabla MAC
   - **Robo de puertos**: Impide usar puertos f√≠sicos para acceso no autorizado

**Mecanismos de aprendizaje de MAC:**

   - **Est√°ticas**: Se configuran manualmente
   - **Din√°micas**: El switch aprende autom√°ticamente
   - **Sticky**: Combina ambos - aprende y luego las hace est√°ticas



### **Comandos Explicados Paso a Paso**

```bash
! HABILITAR PORT SECURITY B√ÅSICO
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport mode access
! PRIMERO debe ser puerto de acceso para habilitar port security

Switch(config-if)# switchport port-security
! Este comando ACTIVA la funcionalidad de port security en el puerto
! Sin esto, los dem√°s comandos de port security no funcionar√°n

Switch(config-if)# switchport port-security maximum 2
! 'maximum' define el n√∫mero m√°ximo de direcciones MAC permitidas
! En este caso, permite hasta 2 dispositivos diferentes

! TIPOS DE VIOLACI√ìN - CR√çTICOS PARA ENTENDER
Switch(config-if)# switchport port-security violation shutdown
! 'violation shutdown' - EL M√ÅS SEGURO
! - Cierra el puerto inmediatamente
! - Lo coloca en estado err-disable
! - Requiere intervenci√≥n manual para reactivar
! - USAR EN ENTORNOS DE ALTA SEGURIDAD

Switch(config-if)# switchport port-security violation restrict
! 'violation restrict' - MODO INTERMEDIO
! - Permite tr√°fico de MACs conocidas
! - Bloquea tr√°fico de MACs no autorizadas
! - Genera logs pero mantiene el puerto activo
! - BUENO para monitoreo sin interrumpir servicio

Switch(config-if)# switchport port-security violation protect
! 'violation protect' - MODO MENOS RESTRICTIVO
! - Solo bloquea frames de MACs no autorizadas
! - No genera logs de violaci√≥n
! - PUEDE PASAR DESAPERCIBIDO UN ATAQUE

! M√âTODOS DE APRENDIZAJE DE MAC
Switch(config-if)# switchport port-security mac-address sticky
! 'sticky' - EL M√ÅS PR√ÅCTICO
! - Aprende las MACs que se conectan inicialmente
! - Las convierte en direcciones est√°ticas autom√°ticamente
! - Se guardan en la configuraci√≥n
! - Perfecto para despliegues iniciales

Switch(config-if)# switchport port-security mac-address 0000.1111.2222
! Configuraci√≥n MANUAL de MAC espec√≠fica
! √ötil para dispositivos cr√≠ticos como impresoras o servidores

! CONFIGURACIONES AVANZADAS
Switch(config-if)# switchport port-security aging time 120
! 'aging time' define cu√°nto tiempo se mantiene una MAC en la tabla
! 120 minutos = 2 horas

Switch(config-if)# switchport port-security aging type inactivity
! 'inactivity' significa que el temporizador corre solo si no hay tr√°fico
! Alternativa: 'absolute' (tiempo fijo independiente del tr√°fico)
```

### **Ejemplo Pr√°ctico Completo**

```bash
! ESCENARIO: Oficina con pol√≠ticas de seguridad espec√≠ficas

! Puerto para impresora (1 dispositivo fijo)
Switch(config)# interface fastethernet 0/5
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# switchport port-security mac-address 0050.56AB.CDEF
Switch(config-if)# description IMPRESORA_SALA_VENTAS

! Puerto para usuarios generales (hasta 3 dispositivos)
Switch(config)# interface fastethernet 0/10
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 3
Switch(config-if)# switchport port-security violation restrict
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security aging time 240
Switch(config-if)# description PUESTO_TRABAJO_USUARIO

! Configurar recuperaci√≥n autom√°tica de err-disable
Switch(config)# errdisable recovery cause psecure-violation
Switch(config)# errdisable recovery interval 300
! Esto reactiva autom√°ticamente puertos despu√©s de 5 minutos

! VERIFICACI√ìN DETALLADA
Switch# show port-security
! Muestra resumen de todos los puertos con port security

Switch# show port-security interface fastethernet 0/10
! Muestra detalles espec√≠ficos del puerto:
! - M√°ximo de direcciones permitidas
! - Direcciones actualmente aprendidas
! - Contador de violaciones
! - Tipo de violaci√≥n configurado

Switch# show port-security address
! Muestra la tabla de direcciones MAC seguras aprendidas
```

## üåê **3. DHCP Snooping**

## **¬øPero qu√© es DHCP?**

### üîÑ **¬øQu√© es DHCP?**

**DHCP (Dynamic Host Configuration Protocol)** es el "servicio de entrega de direcciones" autom√°tico de las redes. En lugar de configurar manualmente cada dispositivo, DHCP asigna autom√°ticamente:

- ‚úÖ **Direcci√≥n IP**
- ‚úÖ **M√°scara de subred** 
- ‚úÖ **Gateway por defecto**
- ‚úÖ **Servidores DNS**

## üì¶ **El Proceso de 4 Pasos (DORA)**

### **1. üéØ DISCOVER - "¬øHay alg√∫n servidor DHCP?"**
```bash
Cliente ‚Üí Broadcast: "¬°Hola! Necesito una IP, ¬øalguien puede ayudarme?"
```
- El cliente env√≠a broadcast sin IP
- Todos los dispositivos en la red local lo reciben

### **2. üì® OFFER - "S√≠, te ofrezco esta IP"**
```bash
Servidor DHCP ‚Üí Cliente: "Te ofrezco la IP 192.168.1.100"
```
- Servidor reserva una IP disponible
- Env√≠a oferta con configuraci√≥n de red

### **3. üìù REQUEST - "Acepto tu oferta"** 
```bash
Cliente ‚Üí Broadcast: "Acepto la IP 192.168.1.100 del servidor X"
```
- Cliente confirma que acepta la IP
- Se hace por broadcast por si hay m√∫ltiples servidores

### **4. ‚úÖ ACK - "Confirmado, usa esta IP"**
```bash
Servidor DHCP ‚Üí Cliente: "Confirmado, usa 192.168.1.100 por 24 horas"
```
- Confirmaci√≥n final del servidor
- Incluye tiempo de arrendamiento (lease time)

## ‚è∞ **Renovaci√≥n de IP**

```bash
# A LOS 50% DEL TIEMPO DE ARRENDAMIENTO:
Cliente ‚Üí Servidor: "¬øPuedo seguir usando esta IP?"
Servidor ‚Üí Cliente: "S√≠, renuevas por X tiempo m√°s"

# SI NO HAY RESPUESTA, INTENTA DE NUEVO AL 87.5%
# SI EXPIRA ‚Üí VUELVE AL PASO 1 (DISCOVER)
```

![Funcionamiento de DHCP](img/DHCP2.jpg){width=600 height=300}

## üéØ **En Resumen**

**DHCP = Sistema autom√°tico que evita tener que configurar manualmente cada dispositivo en la red, asignando y gestionando direcciones IP de forma din√°mica.**

**Funciona como un "alquiler de direcciones" con renovaci√≥n autom√°tica.**

### **¬øQu√© es DHCP Snooping?**
La funci√≥n exacta de DHCP Snooping es actuar como un guardi√°n de seguridad que previene ataques DHCP maliciosos mediante la creaci√≥n de una base de datos confiable de asignaciones IP-MAC, diferenciando entre puertos trusted (donde se conectan servidores DHCP leg√≠timos) y untrusted (clientes), bloqueando respuestas DHCP no autorizadas y proporcionando la base de datos que tecnolog√≠as como DAI e IP Source Guard utilizan para validar la legitimidad del tr√°fico ARP y las direcciones IP en la red.

En esencia: DHCP Snooping es el sistema de verificaci√≥n de identidades que asegura que solo dispositivos autorizados puedan ofrecer direcciones IP y mantiene un registro confiable de qu√© dispositivo tiene qu√© IP en qu√© puerto.
DHCP Snooping es la BASE, DAI es la CAPA DE SEGURIDAD que usa esa base

### **Analog√≠a para Entenderlo**

Imagina un edificio con:
- **Servidores DHCP leg√≠timos** = Oficinas de administraci√≥n autorizadas
- **Clientes DHCP** = Inquilinos que necesitan llaves (IPs)
- **Ataque DHCP Rogue** = Alguien fingiendo ser la administraci√≥n
- **DHCP Snooping** = El sistema de seguridad que verifica credenciales

![](img/dhcp_snooping1.png)

![](img/dhcp_snooping2.jpg)

## üîç **Problemas que Resuelve DHCP Snooping**

### **1. Ataque DHCP Starvation (Inanici√≥n)**
```bash
# Un atacante env√≠a M√öLTIPLES solicitudes DHCP con MACs falsas
# Resultado: Agota el pool de IPs del servidor leg√≠timo
# Clientes leg√≠timos no pueden obtener IP
```

### **2. Ataque DHCP Rogue (Servidor Falso)**
```bash
# Atacante configura servidor DHCP no autorizado
# Ofrece IPs con:
# - Gateway falso (el atacante)
# - DNS falso (para redirigir tr√°fico)
# Resultado: Man-in-the-Middle completo
```

### **3. IP Spoofing (Suplantaci√≥n de IP)**
```bash
# Clientes usan IPs que no les corresponden
# Dif√≠cil de rastrear en la red
# Puede eludir controles de seguridad basados en IP
```

## üèóÔ∏è **Arquitectura de DHCP Snooping**

### **Componentes Clave**

1. **Puertos Trusted (Confiables)**

      - Donde est√°n los servidores DHCP leg√≠timos
      - **Aceptan** mensajes DHCP de cualquier tipo

2. **Puertos Untrusted (No Confiables)**

      - Donde se conectan clientes
      - **Solo aceptan** solicitudes DHCP (DISCOVER, REQUEST)
      - **Rechazan** respuestas DHCP (OFFER, ACK)

3. **Binding Database (Base de Datos de Asignaciones)**

      - Almacena: MAC + IP + VLAN + Puerto + Tiempo de arrendamiento
      - Se usa por DAI y IP Source Guard



## ‚öôÔ∏è **Configuraci√≥n Detallada Paso a Paso**

### **Configuraci√≥n B√°sica**

```bash
! PASO 1: HABILITAR DHCP SNOOPING GLOBALMENTE
Switch(config)# ip dhcp snooping
! Este comando ACTIVA la funcionalidad a nivel global
! Sin esto, nada de DHCP Snooping funcionar√°

! PASO 2: ESPECIFICAR VLANs DONDE ACTUAR√Å
Switch(config)# ip dhcp snooping vlan 10,20,30
! Solo las VLANs especificadas estar√°n protegidas
! Puedes usar rangos: vlan 1-100

! PASO 3: CONFIGURAR PUERTOS TRUSTED
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# description SERVIDOR_DHCP_LEGITIMO
Switch(config-if)# ip dhcp snooping trust
! MARCA este puerto como confiable para respuestas DHCP
! Los servidores DHCP leg√≠timos DEBEN estar en puertos trusted

! PASO 4: PUERTOS UNTRUSTED (POR DEFECTO)
Switch(config)# interface range fastethernet 0/1-24
Switch(config-if-range)# no ip dhcp snooping trust
! Expl√≠citamente los marca como no confiables
! Aunque por defecto ya lo son, es buena pr√°ctica
```

### **Configuraci√≥n Avanzada**

```bash
! OPCI√ìN 82 (AGENT INFORMATION OPTION)
Switch(config)# ip dhcp snooping information option
! A√±ade informaci√≥n sobre el switch y puerto donde se origin√≥ la solicitud
! Ayuda a los servidores DHCP a tomar decisiones basadas en ubicaci√≥n

! LIMITAR TASA DE MENSAJES DHCP
Switch(config)# interface fastethernet 0/5
Switch(config-if)# ip dhcp snooping limit rate 10
! Limita a 10 mensajes DHCP por segundo
! Previene ataques de inundaci√≥n (DHCP starvation)

! CONFIGURACI√ìN DE LA BASE DE DATOS
Switch(config)# ip dhcp snooping database flash:dhcp-snooping.txt
Switch(config)# ip dhcp snooping database write-delay 15
! Guarda la base de datos en memoria flash cada 15 segundos
! Previene p√©rdida de informaci√≥n en reinicios
```

## üîß **Ejemplos Pr√°cticos de Configuraci√≥n**

### **Ejemplo 1: Peque√±a Oficina**

```bash
! ESCENARIO: 1 servidor DHCP, 24 puertos de usuario
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10

! Servidor DHCP en puerto Gigabit 0/1
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# description SERVIDOR_DHCP
Switch(config-if)# ip dhcp snooping trust

! Puertos de usuarios (untrusted por defecto)
Switch(config)# interface range fastethernet 0/1-24
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# ip dhcp snooping limit rate 5
! Limita a 5 mensajes/segundo para prevenir ataques
```

### **Ejemplo 2: Empresa Mediana con M√∫ltiples VLANs**

```bash
! ESCENARIO: M√∫ltiples departamentos, servidor centralizado
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10,20,30,99
Switch(config)# ip dhcp snooping information option

! Uplink al core donde est√° el servidor DHCP
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# description UPLINK_TO_CORE
Switch(config-if)# switchport mode trunk
Switch(config-if)# ip dhcp snooping trust

! VLAN de Ventas
Switch(config)# interface range fastethernet 0/1-8
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# ip dhcp snooping limit rate 8

! VLAN de IT
Switch(config)# interface range fastethernet 0/9-16
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# ip dhcp snooping limit rate 8

! VLAN de Administraci√≥n
Switch(config)# interface range fastethernet 0/17-24
Switch(config-if-range)# switchport access vlan 99
Switch(config-if-range)# ip dhcp snooping limit rate 8
```

### **Ejemplo 3: Entorno de Alta Seguridad**

```bash
! ESCENARIO: Entorno cr√≠tico con verificaci√≥n estricta
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 1-100
Switch(config)# ip dhcp snooping information option
Switch(config)# ip dhcp snooping verify mac-address
! VERIFICA que la MAC origen en DHCP sea la real del cliente
! Previene suplantaci√≥n de MAC en mensajes DHCP

! Base de datos persistente
Switch(config)# ip dhcp snooping database flash:dhcp-snooping.db
Switch(config)# ip dhcp snooping database timeout 10
Switch(config)# ip dhcp snooping database write-delay 10

! Puertos trusted expl√≠citos
Switch(config)# interface range gigabitethernet 0/1-2
Switch(config-if-range)# description SERVERS_DHCP_TRUSTED
Switch(config-if-range)# ip dhcp snooping trust

! Todos los dem√°s puertos son untrusted con rate limiting estricto
Switch(config)# interface range fastethernet 0/1-48
Switch(config-if-range)# no ip dhcp snooping trust
Switch(config-if-range)# ip dhcp snooping limit rate 5
! Solo 5 mensajes DHCP por segundo - muy restrictivo
```

## üõ†Ô∏è **Integraci√≥n con Otras Tecnolog√≠as de Seguridad**

### **Con Dynamic ARP Inspection (DAI)**

```bash
! DHCP Snooping es PRERREQUISITO para DAI
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10

! DAI usa la tabla de bindings de DHCP Snooping
Switch(config)# ip arp inspection vlan 10
Switch(config)# ip arp inspection validate src-mac dst-mac ip
! DAI verifica que las respuestas ARP coincidan con la tabla de DHCP Snooping
```

### **Con IP Source Guard**

```bash
! IP Source Guard tambi√©n depende de DHCP Snooping
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10

Switch(config)# interface fastethernet 0/1
Switch(config-if)# ip verify source
! Solo permite tr√°fico de IPs que est√°n en la tabla de DHCP Snooping
```

## üìä **Comandos de Verificaci√≥n y Monitoreo**

### **Verificaci√≥n B√°sica**

```bash
! VER ESTADO GLOBAL DE DHCP SNOOPING
Switch# show ip dhcp snooping
Switch DHCP snooping is enabled
DHCP snooping is configured on following VLANs:
10,20,30
DHCP snooping is operational on following VLANs:
10,20,30
DHCP snooping is configured on the following L3 Interfaces:

Insertion of option 82 is enabled
   circuit-id default format: vlan-mod-port
   remote-id: 0050.5689.ABCD (MAC del switch)
Option 82 on untrusted port is not allowed
Verification of hwaddr field is enabled

! MOSTRAR LA TABLA DE BINDINGS
Switch# show ip dhcp snooping binding
MacAddress          IpAddress        Lease(sec)  Type           VLAN  Interface
------------------  ---------------  ----------  -------------  ----  --------------------
00:50:56:89:AB:CD   192.168.10.10    86400       dhcp-snooping   10    FastEthernet0/1
00:50:56:89:AB:CE   192.168.10.11    86320       dhcp-snooping   10    FastEthernet0/2
00:50:56:89:AB:CF   192.168.20.15    86200       dhcp-snooping   20    FastEthernet0/9

! VER ESTADO DE PUERTOS TRUSTED
Switch# show ip dhcp snooping trust
Trusted | Port | 
------- | ---- | 
yes     | Gi0/1 | 
no      | Fa0/1 | 
no      | Fa0/2 | 
...     | ...  |
```

### **Estad√≠sticas y Troubleshooting**

```bash
! ESTAD√çSTICAS DETALLADAS POR INTERFAZ
Switch# show ip dhcp snooping interface fastethernet 0/1
DHCP Snooping is enabled on this interface
DHCP Snooping trust is disabled
DHCP Snooping limit rate is 5 packets per second
DHCP Snooping violation count is 0

! CONTADORES DE MENSAJES DHCP
Switch# show ip dhcp snooping statistics
DHCP Snooping Statistics:
  Packets Dropped:
    DHCP Discover: 0
    DHCP Offer: 15
    DHCP Request: 0
    DHCP Ack: 12
    Others: 3
  Total Packets Dropped: 30

! VERIFICAR LA BASE DE DATOS
Switch# show ip dhcp snooping database
Agent URL : flash:dhcp-snooping.db
Write delay : 15 seconds
Abort delay : 300 seconds
Agent running : No
Delay timer : not running
Reconfigure timer : not running
Last succeeded : Never
Last failed : Never
```

### **Comandos de Depuraci√≥n (Debug)**

```bash
! SOLO USAR EN TROUBLESHOOTING - PUEDE GENERAR MUCHO OUTPUT
Switch# debug ip dhcp snooping events
DHCP_SNOOPING: received new DHCP packet from interface FastEthernet0/1
DHCP_SNOOPING: process new DHCP packet, message type: DHCPDISCOVER
DHCP_SNOOPING: packet passed validation check

Switch# debug ip dhcp snooping packet
DHCP_SNOOPING: received packet on FastEthernet0/1: 
  OP: 1, HTYPE: 1, HLEN: 6, HOPS: 0
  XID: 0x45A3F1C2, SECS: 0, FLAGS: 0
  CIADDR: 0.0.0.0, YIADDR: 0.0.0.0, SIADDR: 0.0.0.0, GIADDR: 0.0.0.0
  CHADDR: 0050.5689.ABCD
```

## üîÑ **Flujo de Trabajo Completo de DHCP Snooping**

### **Proceso Paso a Paso**

1. **Inicializaci√≥n:**
   ```bash
   Switch arranca ‚Üí DHCP Snooping deshabilitado por defecto
   Administrador ejecuta: ip dhcp snooping
   Se crea tabla de bindings vac√≠a
   ```

2. **Aprendizaje:**
   ```bash
   Cliente conecta en Fa0/1 (untrusted)
   Env√≠a DHCP DISCOVER ‚Üí Switch permite (solicitud)
   Servidor leg√≠timo en Gi0/1 (trusted) env√≠a DHCP OFFER ‚Üí Switch permite (trusted)
   Cliente env√≠a DHCP REQUEST ‚Üí Switch permite
   Servidor env√≠a DHCP ACK ‚Üí Switch permite (trusted)
   Switch a√±ade binding a la tabla: MAC + IP + VLAN + Puerto
   ```

3. **Protecci√≥n:**
   ```bash
   Atacante conecta servidor rogue en Fa0/10 (untrusted)
   Env√≠a DHCP OFFER no solicitado ‚Üí Switch BLOQUEA y registra violaci√≥n
   Cliente leg√≠timo solo ve ofertas del servidor autorizado
   ```

4. **Mantenimiento:**
   ```bash
   Switch monitorea renewals y expiraciones
   Actualiza tabla de bindings autom√°ticamente
   Guarda base de datos peri√≥dicamente en memoria no vol√°til
   ```

## üí° **Mejores Pr√°cticas y Recomendaciones**

### **Configuraci√≥n Recomendada**

```bash
! CONFIGURACI√ìN √ìPTIMA PARA ENTORNOS CORPORATIVOS
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan [TODAS_LAS_VLANs_CON_CLIENTES]
Switch(config)# ip dhcp snooping information option
Switch(config)# ip dhcp snooping verify mac-address
Switch(config)# ip dhcp snooping database flash:dhcp-snooping.db
Switch(config)# ip dhcp snooping database write-delay 15

! PUERTOS TRUSTED - SOLO DONDE HAY SERVIDORES DHCP LEG√çTIMOS
Switch(config)# interface [PUERTOS_A_SERVIDORES_DHCP]
Switch(config-if)# ip dhcp snooping trust

! PUERTOS UNTRUSTED - TODOS LOS DEM√ÅS
Switch(config)# interface range [TODOS_LOS_PUERTOS_DE_CLIENTES]
Switch(config-if-range)# no ip dhcp snooping trust
Switch(config-if-range)# ip dhcp snooping limit rate 10
```

### **Consideraciones Importantes**

1. **Planificaci√≥n:**
   
      - Implementar en ventana de mantenimiento
      - Comenzar en VLANs de prueba
      - Tener rollback plan

2. **Rendimiento:**
   
      - Rate limiting muy bajo puede afectar clientes leg√≠timos
      - Base de datos grande puede consumir memoria

3. **Compatibilidad:**
   
      - Verificar que dispositivos legados funcionen
      - Algunos dispositivos IoT pueden tener comportamientos DHCP extra√±os

4. **Monitoreo:**
   
      - Configurar SNMP traps para violaciones
      - Monitorear contadores de paquetes descartados
      - Revisar logs regularmente

## üéØ **Resumen Final**

**DHCP Snooping es la base fundamental** para:

   - ‚úÖ Prevenir servidores DHCP no autorizados
   - ‚úÖ Construir la tabla de bindings para DAI e IP Source Guard
   - ‚úÖ Detectar y prevenir ataques de inundaci√≥n DHCP
   - ‚úÖ Mejorar la trazabilidad de dispositivos en la red

**Sin DHCP Snooping, las dem√°s tecnolog√≠as de seguridad (DAI, IP Source Guard) no pueden funcionar correctamente.**


## üõ°Ô∏è **3. Dynamic ARP Inspection (DAI)**

### **Concepto Te√≥rico Detallado**

**¬øQu√© es DAI?**
Es un mecanismo de seguridad que **previene ataques ARP spoofing** validando paquetes ARP en la red.

**Problema del ARP:**

   - ARP no tiene autenticaci√≥n ‚Üí Cualquiera puede enviar respuestas ARP
   - **ARP poisoning**: Atacante se hace pasar por el gateway
   - **Man-in-the-middle**: Intercepta tr√°fico entre v√≠ctima y gateway

**C√≥mo funciona DAI:**

   1. **Intercepta** todos los paquetes ARP
   2. **Valida** contra base de datos confiable (DHCP Snooping)
   3. **Descarta** paquetes ARP no v√°lidos
   4. **Registra** intentos de violaci√≥n

DAI utiliza la tabla de DHCP Snooping EXCLUSIVAMENTE cuando recibe un ARP Response (Respuesta ARP)

### **Comandos Explicados Paso a Paso**

```bash
! CONFIGURACI√ìN B√ÅSICA DE DAI
Switch(config)# ip arp inspection vlan 10,20
! Habilita DAI para las VLANs especificadas
! Sin este comando, DAI no est√° activo en ninguna VLAN

! DEFINIR PUERTOS TRUSTED (CONFIABLES)
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# ip arp inspection trust
! Los puertos 'trusted' NO son inspeccionados por DAI
! USAR SOLO en: routers, servidores, switches superiores
! NUNCA en puertos de usuarios finales

! VALIDACIONES ESPEC√çFICAS
Switch(config)# ip arp inspection validate src-mac dst-mac ip
! 'src-mac' - Verifica que MAC origen en ARP = MAC origen en Ethernet
! 'dst-mac' - Verifica que MAC destino en ARP = MAC destino en Ethernet  
! 'ip' - Verifica direcciones IP v√°lidas (no 0.0.0.0, 255.255.255.255, etc.)

! RATE LIMITING - CR√çTICO PARA PREVENIR DOS
Switch(config)# interface fastethernet 0/5
Switch(config-if)# ip arp inspection limit rate 15
! Limita a 15 paquetes ARP por segundo
! Paquetes excedentes son descartados
! Previene flood de ARP que podr√≠a saturar la CPU
```

### **Configuraci√≥n Integrada con DHCP Snooping**

```bash
! PRIMERO: Configurar DHCP Snooping (requisito para DAI)
Switch(config)# ip dhcp snooping
! Habilita la funcionalidad global de DHCP Snooping

Switch(config)# ip dhcp snooping vlan 10,20
! Especifica en qu√© VLANs actuar√° DHCP Snooping

Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# ip dhcp snooping trust
! Puertos trusted para DHCP (hacia servidores DHCP leg√≠timos)

! SEGUNDO: Configurar DAI que usa la tabla de DHCP Snooping
Switch(config)# ip arp inspection vlan 10,20
! DAI usar√° la tabla de bindings de DHCP Snooping para validar

Switch(config)# ip arp inspection log-buffer entries 1024
! Buffer para almacenar logs de violaciones ARP

Switch(config)# ip arp inspection log-buffer logs 10 interval 60
! Genera logs cada 60 segundos si hay m√°s de 10 violaciones

! CONFIGURACI√ìN POR PUERTO DE USUARIO
Switch(config)# interface range fastethernet 0/1-24
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# ip arp inspection limit rate 10
! Todos los puertos de usuario tienen rate limiting
! Por defecto son untrusted (inspeccionados)
```

### **Ejemplo Pr√°ctico Completo**

```bash
! ESCENARIO: Red corporativa con m√∫ltiples VLANs

! 1. Configurar DHCP Snooping
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10,20,30
Switch(config)# ip dhcp snooping information option
! 'information option' a√±ade informaci√≥n adicional (option 82)

! 2. Definir puertos trusted
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# description UPLINK_TO_CORE_SWITCH
Switch(config-if)# ip dhcp snooping trust
Switch(config-if)# ip arp inspection trust

Switch(config)# interface gigabitethernet 0/2  
Switch(config-if)# description LINK_TO_DHCP_SERVER
Switch(config-if)# ip dhcp snooping trust
Switch(config-if)# ip arp inspection trust

! 3. Configurar DAI
Switch(config)# ip arp inspection vlan 10,20,30
Switch(config)# ip arp inspection validate src-mac dst-mac ip
Switch(config)# ip arp inspection log-buffer entries 2048

! 4. Configurar puertos de usuario
Switch(config)# interface range fastethernet 0/1-48
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# ip arp inspection limit rate 15
Switch(config-if-range)# no ip dhcp snooping trust
! Expl√≠citamente configurados como untrusted

! VERIFICACI√ìN
Switch# show ip arp inspection
! Muestra configuraci√≥n global de DAI

Switch# show ip arp inspection statistics
! Muestra contadores de paquetes procesados y descartados

Switch# show ip dhcp snooping binding
! Muestra la tabla de bindings IP-MAC-puerto
! ESTA TABLA ES LA QUE USA DAI PARA VALIDAR

Switch# show ip arp inspection interface fastethernet 0/10
! Muestra estad√≠sticas espec√≠ficas por puerto
```

---

## üåâ **4. BPDU Guard & BPDU Filter**

### **Concepto Te√≥rico Detallado**

**¬øQu√© son las BPDUs?**
BPDU (Bridge Protocol Data Units) son mensajes que intercambian los switches para **construir y mantener el spanning-tree**.

**Problemas que resuelven:**
- **Switches no autorizados**: Usuario conecta un switch casero
- **Bucles de red**: Configuraciones incorrectas crean loops
- **Interrupciones de servicio**: Topolog√≠a STP cambia inesperadamente

### **BPDU Guard - Explicaci√≥n Detallada**

**Prop√≥sito**: Proteger puertos de acceso contra recepci√≥n de BPDUs

**Comportamiento**:
- Si recibe BPDU ‚Üí **err-disable** inmediato
- Ideal para **puertos con usuarios finales**
- Se activa solo en puertos con **PortFast**

### **Comandos BPDU Guard**

```bash
! M√âTODO 1: Global (recomendado para consistencia)
Switch(config)# spanning-tree portfast bpduguard default
! Aplica BPDU Guard autom√°ticamente a TODOS los puertos con PortFast
! M√âTODO M√ÅS EFICIENTE para despliegues grandes

! M√âTODO 2: Por interfaz
Switch(config)# interface fastethernet 0/1
Switch(config-if)# spanning-tree portfast
! PortFast salta estados temporales (listening/learning)
Switch(config-if)# spanning-tree bpduguard enable
! Habilita BPDU Guard espec√≠ficamente en este puerto

! RECUPERACI√ìN AUTOM√ÅTICA
Switch(config)# errdisable recovery cause bpduguard
Switch(config)# errdisable recovery interval 300
! Reactiva puertos autom√°ticamente despu√©s de 5 minutos
```

### **BPDU Filter - Explicaci√≥n Detallada**

**Prop√≥sito**: **Silenciar** BPDUs en puertos espec√≠ficos

**Comportamiento**:
- **Bloquea env√≠o y recepci√≥n** de BPDUs
- **Peligroso**: Puede crear bucles si no se usa correctamente
- **Caso de uso**: Conectar dispositivos que env√≠an BPDUs pero no deben participar en STP

### **Comandos BPDU Filter**

```bash
! M√âTODO 1: Global
Switch(config)# spanning-tree portfast bpdufilter default
! Aplica BPDU Filter a todos los puertos con PortFast
! CUIDADO: Puede causar bucles si se conecta un switch

! M√âTODO 2: Por interfaz
Switch(config)# interface fastethernet 0/2
Switch(config-if)# spanning-tree bpdufilter enable
! Habilita BPDU Filter espec√≠ficamente en este puerto
```

### **Ejemplo Pr√°ctico: Cu√°ndo Usar Cada Uno**

```bash
! ESCENARIO: Oficina con diferentes tipos de puertos

! 1. Puertos de usuario normal - USAR BPDU GUARD
Switch(config)# interface range fastethernet 0/1-20
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# spanning-tree portfast
Switch(config-if-range)# spanning-tree bpduguard enable
Switch(config-if-range)# description USUARIOS_FINALES
! Si alguien conecta un switch, el puerto se desactiva

! 2. Servidor que env√≠a BPDUs - USAR BPDU FILTER
Switch(config)# interface fastethernet 0/21
Switch(config-if)# switchport mode access  
Switch(config-if)# spanning-tree bpdufilter enable
Switch(config-if)# description SERVIDOR_VMWARE
! El servidor puede enviar BPDUs pero no queremos que participe en STP

! 3. Configuraci√≥n global de seguridad
Switch(config)# spanning-tree portfast bpduguard default
! Para todos los nuevos puertos con PortFast

Switch(config)# errdisable recovery cause bpduguard
Switch(config)# errdisable recovery interval 600
! Recuperaci√≥n autom√°tica despu√©s de 10 minutos

! VERIFICACI√ìN
Switch# show spanning-tree summary
! Muestra estado global de spanning-tree incluyendo BPDU Guard/Filter

Switch# show spanning-tree interface fastethernet 0/1 detail
! Muestra configuraci√≥n espec√≠fica de BPDU Guard/Filter por puerto

Switch# show errdisable recovery
! Muestra configuraci√≥n de recuperaci√≥n autom√°tica
```

---

## üîç **5. IP Source Guard**

### **Concepto Te√≥rico Detallado**

**¬øQu√© es IP Source Guard?**
Es un mecanismo que **filtra tr√°fico IP** bas√°ndose en la tabla de bindings de DHCP Snooping.

**Problemas que resuelve:**
- **IP spoofing**: Usuario usa IP que no le pertenece
- **Ataques DoS**: Dispositivos maliciosos suplantando IPs
- **Robo de servicios**: Usar IPs de otros departamentos

**C√≥mo funciona:**
1. **Aprende** bindings IP-MAC de DHCP Snooping
2. **Instala** filtros en hardware del switch
3. **Permite** solo tr√°fico de IPs autorizadas
4. **Actualiza** din√°micamente cuando expiran leases DHCP

### **Comandos Explicados Paso a Paso**

```bash
! PRERREQUISITO: DHCP Snooping debe estar configurado
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10

! CONFIGURACI√ìN B√ÅSICA DE IP SOURCE GUARD
Switch(config)# interface fastethernet 0/1
Switch(config-if)# ip verify source
! Habilita verificaci√≥n de direcci√≥n IP origen
! Solo permite tr√°fico de IPs que est√°n en la tabla de DHCP Snooping

! CONFIGURACI√ìN AVANZADA CON VERIFICACI√ìN MAC
Switch(config-if)# ip verify source port-security
! 'port-security' a√±ade verificaci√≥n de direcci√≥n MAC tambi√©n
! M√°s seguro pero requiere que Port Security est√© configurado

Switch(config-if)# ip verify source vlan dhcp-snooping port-security
! Verificaci√≥n completa: IP + MAC + VLAN
! M√ÅXIMA SEGURIDAD pero m√°s complejo de implementar
```

### **Ejemplo Pr√°ctico Completo**

```bash
! ESCENARIO: Red segura con validaci√≥n m√∫ltiple

! 1. CONFIGURAR DHCP SNOOPING (BASE PARA TODO)
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10,20
Switch(config)# ip dhcp snooping information option

! Definir puertos trusted
Switch(config)# interface gigabitethernet 0/1
Switch(config-if)# ip dhcp snooping trust
Switch(config-if)# description TO_DHCP_SERVER

! 2. CONFIGURAR PORT SECURITY
Switch(config)# interface range fastethernet 0/1-24
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport port-security
Switch(config-if-range)# switchport port-security maximum 2
Switch(config-if-range)# switchport port-security violation restrict
Switch(config-if-range)# switchport port-security mac-address sticky

! 3. CONFIGURAR IP SOURCE GUARD
Switch(config)# interface range fastethernet 0/1-24
Switch(config-if-range)# ip verify source port-security
! Verifica tanto IP como direcci√≥n MAC
! Solo permite tr√°fico de dispositivos con binding v√°lido

! 4. CONFIGURACI√ìN ALTERNATIVA PARA DISPOSITIVOS EST√ÅTICOS
Switch(config)# interface fastethernet 0/25
Switch(config-if)# description SERVIDOR_ESTATICO
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address 0050.5687.1234
Switch(config-if)# ip verify source
! Para servidores con IP est√°tica, solo verificaci√≥n de IP

! VERIFICACI√ìN COMPLETA
Switch# show ip verify source
! Muestra tabla de bindings activos y estado de verificaci√≥n

Switch# show ip source binding
! Muestra toda la tabla de bindings IP-MAC-VLAN

Switch# show ip dhcp snooping binding
! Muestra bindings aprendidos via DHCP

Switch# show port-security address
! Muestra direcciones MAC seguras

! MONITOREO EN TIEMPO REAL
Switch# debug ip dhcp snooping events
! Para troubleshooting detallado (usar con cuidado en producci√≥n)
```

---

## üèóÔ∏è **CONFIGURACI√ìN INTEGRADA COMPLETA**

### **Switch de Acceso Corporativo Seguro**

```bash
! INICIALIZACI√ìN B√ÅSICA
Switch> enable
Switch# configure terminal
Switch(config)# hostname SW-ACCESO-01

! CONFIGURACI√ìN DE VLANs
SW-ACCESO-01(config)# vlan 10
SW-ACCESO-01(config-vlan)# name USUARIOS
SW-ACCESO-01(config-vlan)# vlan 20
SW-ACCESO-01(config-vlan)# name SERVIDORES
SW-ACCESO-01(config-vlan)# vlan 99
SW-ACCESO-01(config-vlan)# name ADMIN
SW-ACCESO-01(config-vlan)# vlan 999
SW-ACCESO-01(config-vlan)# name NATIVA
SW-ACCESO-01(config-vlan)# exit

! CONFIGURACI√ìN DE ADMINISTRACI√ìN
SW-ACCESO-01(config)# interface vlan 99
SW-ACCESO-01(config-if)# ip address 192.168.99.10 255.255.255.0
SW-ACCESO-01(config-if)# no shutdown
SW-ACCESO-01(config-if)# exit

! CONFIGURACI√ìN DE PUERTOS UPLINK (TRUSTED)
SW-ACCESO-01(config)# interface gigabitethernet 0/1
SW-ACCESO-01(config-if)# description UPLINK_TO_CORE_SWITCH
SW-ACCESO-01(config-if)# switchport mode trunk
SW-ACCESO-01(config-if)# switchport trunk native vlan 999
SW-ACCESO-01(config-if)# switchport trunk allowed vlan 10,20,99
SW-ACCESO-01(config-if)# ip dhcp snooping trust
SW-ACCESO-01(config-if)# ip arp inspection trust
SW-ACCESO-01(config-if)# spanning-tree guard root
SW-ACCESO-01(config-if)# no shutdown

! CONFIGURACI√ìN DE PUERTOS DE USUARIO (UNTRUSTED)
SW-ACCESO-01(config)# interface range fastethernet 0/1-24
SW-ACCESO-01(config-if-range)# description PUERTOS_USUARIOS
SW-ACCESO-01(config-if-range)# switchport mode access
SW-ACCESO-01(config-if-range)# switchport access vlan 10
SW-ACCESO-01(config-if-range)# switchport port-security
SW-ACCESO-01(config-if-range)# switchport port-security maximum 3
SW-ACCESO-01(config-if-range)# switchport port-security violation shutdown
SW-ACCESO-01(config-if-range)# switchport port-security mac-address sticky
SW-ACCESO-01(config-if-range)# switchport port-security aging time 120
SW-ACCESO-01(config-if-range)# spanning-tree portfast
SW-ACCESO-01(config-if-range)# spanning-tree bpduguard enable
SW-ACCESO-01(config-if-range)# ip verify source port-security
SW-ACCESO-01(config-if-range)# ip arp inspection limit rate 15
SW-ACCESO-01(config-if-range)# no ip dhcp snooping trust
SW-ACCESO-01(config-if-range)# no shutdown

! CONFIGURACI√ìN DE PUERTOS DE SERVIDORES
SW-ACCESO-01(config)# interface range gigabitethernet 0/2-4
SW-ACCESO-01(config-if-range)# description SERVIDORES
SW-ACCESO-01(config-if-range)# switchport mode access
SW-ACCESO-01(config-if-range)# switchport access vlan 20
SW-ACCESO-01(config-if-range)# switchport port-security
SW-ACCESO-01(config-if-range)# switchport port-security maximum 1
SW-ACCESO-01(config-if-range)# switchport port-security violation shutdown
SW-ACCESO-01(config-if-range)# spanning-tree portfast
SW-ACCESO-01(config-if-range)# spanning-tree bpduguard enable
SW-ACCESO-01(config-if-range)# ip verify source
SW-ACCESO-01(config-if-range)# no shutdown

! CONFIGURACIONES GLOBALES DE SEGURIDAD
SW-ACCESO-01(config)# ip dhcp snooping
SW-ACCESO-01(config)# ip dhcp snooping vlan 10,20
SW-ACCESO-01(config)# ip dhcp snooping information option

SW-ACCESO-01(config)# ip arp inspection vlan 10,20
SW-ACCESO-01(config)# ip arp inspection validate src-mac dst-mac ip
SW-ACCESO-01(config)# ip arp inspection log-buffer entries 1024

SW-ACCESO-01(config)# spanning-tree portfast bpduguard default
SW-ACCESO-01(config)# spanning-tree portfast bpdufilter default

! RECUPERACI√ìN AUTOM√ÅTICA
SW-ACCESO-01(config)# errdisable recovery cause all
SW-ACCESO-01(config)# errdisable recovery interval 600

! GUARDAR CONFIGURACI√ìN
SW-ACCESO-01(config)# end
SW-ACCESO-01# copy running-config startup-config
```

### **Comandos de Verificaci√≥n y Monitoreo**

```bash
! VERIFICACI√ìN COMPLETA DEL ESTADO
SW-ACCESO-01# show running-config
SW-ACCESO-01# show vlan brief
SW-ACCESO-01# show interfaces status

! VERIFICACI√ìN DE SEGURIDAD
SW-ACCESO-01# show port-security
SW-ACCESO-01# show port-security address
SW-ACCESO-01# show ip dhcp snooping
SW-ACCESO-01# show ip arp inspection
SW-ACCESO-01# show ip verify source

! ESTAD√çSTICAS Y MONITOREO
SW-ACCESO-01# show interface counters errors
SW-ACCESO-01# show errdisable recovery
SW-ACCESO-01# show logging

! TROUBLESHOOTING ESPEC√çFICO
SW-ACCESO-01# show mac address-table interface fastethernet 0/1
SW-ACCESO-01# show ip dhcp snooping binding
SW-ACCESO-01# show spanning-tree interface fastethernet 0/1 detail
```

---

## üéØ **RESUMEN FINAL DE MEJORES PR√ÅCTICAS**

### **Recomendaciones por Tecnolog√≠a:**

1. **VLANs**:
      - Nunca usar VLAN 1 para tr√°fico de usuario
      - VLAN nativa diferente para cada trunk
      - Segmentar por funci√≥n, no solo por ubicaci√≥n

2. **Port Security**:
      - Usar "violation shutdown" en entornos seguros
      - "sticky" para despliegues iniciales
      - Rate limiting en puertos de alta densidad

3. **DAI**:
      - Siempre con DHCP Snooping primero
      - Rate limiting esencial para prevenir DoS
      - Validaci√≥n completa (src-mac + dst-mac + ip)

4. **BPDU Guard**:
      - Global + PortFast para consistencia
      - Recuperaci√≥n autom√°tica configurada
      - Nunca en puertos trunk

5. **IP Source Guard**:
      - Requiere DHCP Snooping funcionando
      - "port-security" para m√°xima seguridad
      - Monitorizar bindings regularmente

### **Flujo de Implementaci√≥n Recomendado:**
1. VLANs y segmentaci√≥n
2. Port Security b√°sica
3. DHCP Snooping
4. DAI con validaciones
5. BPDU Guard
6. IP Source Guard
7. Verificaci√≥n y ajuste


## Portfast

PortFast es una funcionalidad de los switches Cisco que se configura en puertos de acceso que conectan estaciones de trabajo finales (como PCs, impresoras, servidores) y nunca otros switches o dispositivos de red.
¬øQu√© hace PortFast?

    Objetivo principal: Acelerar el inicio de un puerto cuando se enciende un dispositivo conectado a √©l.

    Funcionamiento normal (sin PortFast): Cuando un puerto de switch se activa, el protocolo Spanning Tree (STP) pasa por una serie de estados antes de permitir el tr√°fico de datos:
    Bloqueando ‚Üí Escuchando ‚Üí Aprendiendo ‚Üí Reenv√≠o
    Este proceso puede tomar unos 30 segundos.

    Funcionamiento con PortFast: El puerto se salta los estados de "Escuchando" y "Aprendiendo" y pasa inmediatamente al estado de "Reenv√≠o", permitiendo el tr√°fico casi al instante.

Analog√≠a R√°pida

    Sin PortFast: Es como arrancar un coche en un d√≠a fr√≠o: dejar que el motor se caliente antes de poder circular.

    Con PortFast: Es como tener el coche ya caliente y listo para circular en cuanto giras la llave.

Puntos Clave y Advertencias

    ¬øD√≥nde se usa? Solo en puertos de acceso que conectan dispositivos finales.

    ¬øQu√© evita? La espera de 30 segundos para que un usuario obtenga una direcci√≥n IP (DHCP) o pueda empezar a navegar.

    ¬°ADVERTENCIA CRUCIAL! NUNCA actives PortFast en un puerto que conecte a otro switch, hub o router. Esto podr√≠a crear bucles de capa 2 en la red, ya que STP no tendr√≠a tiempo de detectarlos y bloquearlos.

Relaci√≥n con BPDU Guard

PortFast suele ir de la mano con BPDU Guard. Si un usuario conecta por error un switch a un puerto con PortFast, BPDU Guard detectar√° el paquete BPDU (propio de STP) y desactivar√° el puerto inmediatamente, evitando as√≠ un posible bucle. Es el "seguro de seguridad" de PortFast.

En resumen: PortFast es una optimizaci√≥n para puertos de usuarios finales que acelera el acceso a la red, salt√°ndose los lentos estados de STP.


---

### Configuraci√≥n de PortFast

#### **1. Por interfaz (recomendado)**
```bash
Switch# configure terminal
Switch(config)# interface [tipo-n√∫mero]  # Ej: gigabitethernet 0/1
Switch(config-if)# spanning-tree portfast
```

**Para habilitar BPDU Guard en la misma interfaz:**
```bash
Switch(config-if)# spanning-tree bpduguard enable
```

#### **2. De forma global (m√°s r√°pido)**
Habilita PortFast en **todas** las interfaces que no son trunk y est√°n en estado *connected*:
```bash
Switch# configure terminal
Switch(config)# spanning-tree portfast default
```

**Para habilitar BPDU Guard de forma global:**
```bash
Switch(config)# spanning-tree portfast bpduguard default
```

---

### Verificaci√≥n
```bash
Switch# show spanning-tree interface [tipo-n√∫mero] detail
```
Busca en la salida:
- `Portfast enabled`
- `Bpdu guard enabled`

---

### Comandos importantes para aclarar dudas

**¬øLa interfaz es de acceso o trunk?**
```bash
Switch# show interfaces [tipo-n√∫mero] switchport
```

**¬øSe han recibido BPDUs en el puerto?**
```bash
Switch# show spanning-tree interface [tipo-n√∫mero] detail
```

**Si BPDU Guard desactiva un puerto:**
```bash
Switch# show interfaces status err-disabled
Switch# enable
Switch# configure terminal
Switch(config)# interface [tipo-n√∫mero]
Switch(config-if)# shutdown
Switch(config-if)# no shutdown
```

---

### ‚ö†Ô∏è Recordatorio importante

**SOLO uses PortFast en puertos que conecten dispositivos finales** (PCs, impresoras, servidores). **NUNCA** en puertos que conecten a otros switches, routers o puntos de acceso inal√°mbricos, ya que podr√≠as causar bucles en la red.

La combinaci√≥n **PortFast + BPDU Guard** es la pr√°ctica m√°s segura y com√∫n.